## SQL and SQLite

**SQL (Structured Query Language)** is a standard language for managing and manipulating relational databases. It is used to create, read, update, and delete data within database systems.

**SQLite** is a lightweight, serverless, self-contained SQL database engine. It is widely used for local/client-side storage in applications due to its simplicity and minimal setup requirements.

Key points:
- SQL is the language; SQLite is a database engine that implements SQL.
- SQLite databases are stored as single files on disk.
- Common SQL commands: `SELECT`, `INSERT`, `UPDATE`, `DELETE`, `CREATE TABLE`, `DROP TABLE`.
- SQLite is suitable for small to medium-sized applications, prototyping, and testing.

In [3]:
import sqlite3

In [4]:
connection = sqlite3.connect('example.db')
connection

In [5]:
cursor = connection.cursor()

In [6]:
## create a table

cursor.execute('''
 Create Table If Not Exists employee(
       id Integer Primary Key,
       name Text Not Null,
       age Integer,
       department text         
 )
''')

# commit the changes

connection.commit()

In [7]:

cursor.execute('''
 Select  * from employee      
 
''')

In [8]:
# insert the data in sqlite table
cursor.execute('''
   Insert Into employee(name,age,department)
               values('Rups',20,'Data Scientist')
''')
cursor.execute('''
   Insert Into employee(name,age,department)
               values('Rihan',22,'Data analyst')
''')
cursor.execute('''
   Insert Into employee(name,age,department)
               values('Ritwik',24,'Data engineer')
''')
cursor.execute('''
   Insert Into employee(name,age,department)
               values('Raj',20,'Finance')
''')

connection.commit()

In [9]:
# query the data

cursor.execute('Select * from employee')
rows=cursor.fetchall()

for row in rows:
  print(row)

(1, 'Rups', 20, 'Data Scientist')
(2, 'Rups', 20, 'Data Scientist')
(3, 'Rihan', 22, 'Data analyst')
(4, 'Ritwik', 24, 'Data engineer')
(5, 'Raj', 34, 'Finance')
(6, 'Rups', 20, 'Data Scientist')
(7, 'Rihan', 22, 'Data analyst')
(8, 'Ritwik', 24, 'Data engineer')
(9, 'Raj', 34, 'Finance')
(10, 'Rups', 20, 'Data Scientist')
(11, 'Rihan', 22, 'Data analyst')
(12, 'Ritwik', 24, 'Data engineer')
(13, 'Raj', 20, 'Finance')

In [10]:
cursor.execute('''
 UPDATE employee
 Set age=34
  where name= 'Raj'                       
''')

connection.commit()

In [11]:

cursor.execute('Select * from employee')
rows=cursor.fetchall()

for row in rows:
  print(row)

(1, 'Rups', 20, 'Data Scientist')
(2, 'Rups', 20, 'Data Scientist')
(3, 'Rihan', 22, 'Data analyst')
(4, 'Ritwik', 24, 'Data engineer')
(5, 'Raj', 34, 'Finance')
(6, 'Rups', 20, 'Data Scientist')
(7, 'Rihan', 22, 'Data analyst')
(8, 'Ritwik', 24, 'Data engineer')
(9, 'Raj', 34, 'Finance')
(10, 'Rups', 20, 'Data Scientist')
(11, 'Rihan', 22, 'Data analyst')
(12, 'Ritwik', 24, 'Data engineer')
(13, 'Raj', 34, 'Finance')

In [12]:
cursor.execute('''
Delete from employee
               where name='Rups'
''')
connection.commit()

In [13]:

cursor.execute('Select * from employee')
rows=cursor.fetchall()

for row in rows:
  print(row)

(3, 'Rihan', 22, 'Data analyst')
(4, 'Ritwik', 24, 'Data engineer')
(5, 'Raj', 34, 'Finance')
(7, 'Rihan', 22, 'Data analyst')
(8, 'Ritwik', 24, 'Data engineer')
(9, 'Raj', 34, 'Finance')
(11, 'Rihan', 22, 'Data analyst')
(12, 'Ritwik', 24, 'Data engineer')
(13, 'Raj', 34, 'Finance')

In [20]:
# working with the sales data

connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()

cursor.execute('''
CREATE TABLE IF NOT EXISTS sales (
            id INTEGER PRIMARY KEY,
               date TEXT NOT NULL,
               product TEXT NOT NULL,
               sales INTEGER,
               region TEXT   
)
''')

sales_data=[
  ('2025-05-25','Product1',100,'North'),
  ('2025-05-26','Product2',200,'South'),
  ('2025-05-27','Product3',300,'North'),
  ('2025-05-29','Product4',400,'West'),
  ('2025-05-30','Product5',500,'East'),
]

cursor.executemany('''
    Insert into sales(date,product,sales,region)
                   values(?,?,?,?)
''',sales_data)
connection.commit()

In [24]:
cursor.execute('SELECT * FROM sales')
rows=cursor.fetchall()

for row in rows:
  print(row)

(1, '2025-05-25', 'Product1', 100, 'North')
(2, '2025-05-26', 'Product2', 200, 'South')
(3, '2025-05-27', 'Product3', 300, 'North')
(4, '2025-05-29', 'Product4', 400, 'West')
(5, '2025-05-30', 'Product5', 500, 'East')

In [25]:
### close the connection
connection.close()